app/controllers/articles_controller.rb

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "articles" SET "view_count" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["view_count", 1], ["updated_at", "2016-01-14 19:34:29.481307"], ["id", 9]]
---
	def show
		@article = Article.find(params[:id])
		@article.view_count += 1 #or @article.increment_view_count -> function in article.rb
		@article.save

INSERT INTO "articles" ("title", "body", "view_count", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Checking View Count"], ["body", "RIP Alan "], ["view_count", 0], ["created_at", "2016-01-14 19:24:30.310104"], ["updated_at", "2016-01-14 19:24:30.310104"]]
---
	def create
		@article = Article.new(article_params)
		@article.save

SELECT "articles".* FROM "articles"
---
	def show_by_month
		@articles = Article.all.select{|a| a.created_at.month == params[:month].to_i}

SELECT  "articles".* FROM "articles"  ORDER BY "articles"."view_count" DESC LIMIT 5
---
	def show_by_popularity
		@articles = Article.all.order(view_count: :desc).limit(5)